IDENTIFICATION DIVISION.
PROGRAM-ID. CLASS_db35bde703321c750c7-TEST.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 loopIdx PIC S9(9).





PROCEDURE DIVISION.
Begin.
    STOP RUN.
